In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('Amazon product data')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1503384 entries, 0 to 1503383
Data columns (total 9 columns):
salesRank      1422273 non-null object
brand          97407 non-null object
categories     1503384 non-null object
related        1057123 non-null object
asin           1503384 non-null object
title          1502696 non-null object
price          574882 non-null float64
imUrl          1503305 non-null object
description    84781 non-null object
dtypes: float64(1), object(8)
memory usage: 103.2+ MB

In [5]:
sales = pd.read_csv("Sales.csv")

In [6]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001533 entries, 0 to 1001532
Data columns (total 4 columns):
Unnamed: 0    1001533 non-null int64
0             1001533 non-null object
1             646136 non-null object
2             444130 non-null object
dtypes: int64(1), object(3)
memory usage: 30.6+ MB

In [7]:
sales.head()

,Unnamed: 0,0,1,2
0,0,"{'also_viewed': ['B00JO8II76', 'B00DGN4R1Q', '...",NaN,NaN
1,1,"{'also_viewed': ['B00E1YRI4C', 'B00D23MC6W', '...",'bought_together': ['B00D23MC6W',"'also_bought': ['0000031852', '0000031895', '..."
2,2,"{'also_viewed': ['B0006JCGUM', 'B000BMTCK6', '...","'bought_together': ['B000BMTCK6', 'B0006JCGUM'","'also_bought': ['B000BMTCK6', 'B0006JCGUM', '..."
3,3,"{'also_viewed': ['B008MTRT1O', 'B00BUG47S4', '...",NaN,NaN
4,4,"{'also_viewed': ['B00A6JD8EA', 'B00BFL4FTA', '...",NaN,NaN

In [8]:
df.head()

,salesRank,brand,categories,related,asin,title,price,imUrl,description
0,{'Clothing': 1233557},Big Dreams,"[['Clothing, Shoes & Jewelry', 'Girls'], ['Clo...","{'also_viewed': ['B00JO8II76', 'B00DGN4R1Q', '...",0000037214,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,6.99,http://ecx.images-amazon.com/images/I/31mCncNu...,NaN
1,{'Sports &amp; Outdoors': 8547},Boutique Cutie,"[['Clothing, Shoes & Jewelry', 'Girls', 'Cloth...","{'also_viewed': ['B00E1YRI4C', 'B00D23MC6W', '...",0000031887,Ballet Dress-Up Fairy Tutu,6.79,http://ecx.images-amazon.com/images/I/314qZjYe...,This adorable basic ballerina tutu is perfect ...
2,{'Kitchen & Dining': 16987},NaN,"[['Clothing, Shoes & Jewelry', 'Novelty, Costu...","{'also_viewed': ['B0006JCGUM', 'B000BMTCK6', '...",0123456479,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,64.98,http://ecx.images-amazon.com/images/I/413tGhqo...,Elegance par excellence. Hand-crafted of the f...
3,{'Clothing': 1180499},NaN,"[['Clothing, Shoes & Jewelry', 'Women', 'Acces...","{'also_viewed': ['B008MTRT1O', 'B00BUG47S4', '...",0456844570,RiZ Women's Beautify Crafted &frac12; Rimmed F...,NaN,http://ecx.images-amazon.com/images/I/31QZTHxv...,NaN
4,{'Clothing': 1038084},NaN,"[['Clothing, Shoes & Jewelry', 'Women', 'Acces...","{'also_viewed': ['B00A6JD8EA', 'B00BFL4FTA', '...",0456808574,Lantin White Visor Wrap Around Ski Style Aviat...,NaN,http://ecx.images-amazon.com/images/I/31UsrgT5...,NaN

In [9]:
df["product_name"] = df["title"]
df["product_id"] = df["asin"]
df = df.drop(["imUrl","description","title","asin","related","brand"], axis = 1)

In [10]:
df.head()

,salesRank,categories,price,product_name,product_id
0,{'Clothing': 1233557},"[['Clothing, Shoes & Jewelry', 'Girls'], ['Clo...",6.99,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214
1,{'Sports &amp; Outdoors': 8547},"[['Clothing, Shoes & Jewelry', 'Girls', 'Cloth...",6.79,Ballet Dress-Up Fairy Tutu,0000031887
2,{'Kitchen & Dining': 16987},"[['Clothing, Shoes & Jewelry', 'Novelty, Costu...",64.98,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479
3,{'Clothing': 1180499},"[['Clothing, Shoes & Jewelry', 'Women', 'Acces...",NaN,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570
4,{'Clothing': 1038084},"[['Clothing, Shoes & Jewelry', 'Women', 'Acces...",NaN,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574

In [11]:
rank = df

In [12]:
rank = rank.drop(["categories"],axis = 1)

In [13]:
rank.head()

,salesRank,price,product_name,product_id
0,{'Clothing': 1233557},6.99,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214
1,{'Sports &amp; Outdoors': 8547},6.79,Ballet Dress-Up Fairy Tutu,0000031887
2,{'Kitchen & Dining': 16987},64.98,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479
3,{'Clothing': 1180499},NaN,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570
4,{'Clothing': 1038084},NaN,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574

In [14]:
df = rank

In [15]:
a = rank["salesRank"].str.replace('\d+', '')

In [16]:
a = a.to_frame()

In [17]:
a.head()

                     salesRank
0               {'Clothing': }
1  {'Sports &amp; Outdoors': }
2       {'Kitchen & Dining': }
3               {'Clothing': }
4               {'Clothing': }

In [18]:
a['salesRank'] = a['salesRank'].map(lambda x: str(x)[2:])
a['salesRank'] = a['salesRank'].map(lambda x: str(x)[:-4])

In [31]:
b = rank['salesRank'].str.extract('(\d+)')

C:\Users\Adithya\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  """Entry point for launching an IPython kernel.

In [19]:
bb = rank['salesRank'].str.extract('(\d+)', expand = True)

In [20]:
bb.head()

         0
0  1233557
1     8547
2    16987
3  1180499
4  1038084

In [21]:
rank["rank"] = bb[0]

In [22]:
rank["category"] = a["salesRank"]

In [23]:
rank.head()

,salesRank,price,product_name,product_id,rank,category
0,{'Clothing': 1233557},6.99,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing
1,{'Sports &amp; Outdoors': 8547},6.79,Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors
2,{'Kitchen & Dining': 16987},64.98,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining
3,{'Clothing': 1180499},NaN,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing
4,{'Clothing': 1038084},NaN,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing

In [24]:
# rank = df['salesRank'].apply(lambda x: pd.Series(str(x).split(':')))

In [25]:
sales.head()

,Unnamed: 0,0,1,2
0,0,"{'also_viewed': ['B00JO8II76', 'B00DGN4R1Q', '...",NaN,NaN
1,1,"{'also_viewed': ['B00E1YRI4C', 'B00D23MC6W', '...",'bought_together': ['B00D23MC6W',"'also_bought': ['0000031852', '0000031895', '..."
2,2,"{'also_viewed': ['B0006JCGUM', 'B000BMTCK6', '...","'bought_together': ['B000BMTCK6', 'B0006JCGUM'","'also_bought': ['B000BMTCK6', 'B0006JCGUM', '..."
3,3,"{'also_viewed': ['B008MTRT1O', 'B00BUG47S4', '...",NaN,NaN
4,4,"{'also_viewed': ['B00A6JD8EA', 'B00BFL4FTA', '...",NaN,NaN

In [26]:
sales = sales.drop(["Unnamed: 0"], axis = 1)
sales.head()

,0,1,2
0,"{'also_viewed': ['B00JO8II76', 'B00DGN4R1Q', '...",NaN,NaN
1,"{'also_viewed': ['B00E1YRI4C', 'B00D23MC6W', '...",'bought_together': ['B00D23MC6W',"'also_bought': ['0000031852', '0000031895', '..."
2,"{'also_viewed': ['B0006JCGUM', 'B000BMTCK6', '...","'bought_together': ['B000BMTCK6', 'B0006JCGUM'","'also_bought': ['B000BMTCK6', 'B0006JCGUM', '..."
3,"{'also_viewed': ['B008MTRT1O', 'B00BUG47S4', '...",NaN,NaN
4,"{'also_viewed': ['B00A6JD8EA', 'B00BFL4FTA', '...",NaN,NaN

In [ ]:
ss =

In [27]:
bought_together = sales['1'].apply(lambda x: pd.Series(str(x).split(': [')))

In [28]:
also_viewed = sales['0'].apply(lambda x: pd.Series(str(x).split(': [')))

In [29]:
also_bought = sales['2'].apply(lambda x: pd.Series(str(x).split(': [')))

In [30]:
sales['also_viewed'] = also_viewed[1]
sales['bought_together'] = bought_together[1]
sales['also_bought'] = also_bought[1]

In [61]:
bb['also_viewed'] = also_viewed[1]
bb['bought_together'] = bought_together[1]
bb['also_bought'] = also_bought[1]

In [64]:
bb.head()

,0,also_viewed,bought_together,also_bought
0,1233557,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C']}",NaN,NaN
1,8547,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00..."
2,16987,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00..."
3,1180499,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,1038084,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [31]:
# sales = sales.join(also_viewed)
# sales = sales.join(bought_together)
# sales = sales.join(also_bought)
sales = sales.drop(["0","1","2"], axis = 1)
sales = sales.replace({']}': ''}, regex=True)

In [32]:
sales.head()

,also_viewed,bought_together,also_bought
0,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN
1,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00..."
2,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00..."
3,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [ ]:
# rank = rank.replace({'}': ''}, regex=True)
# rank = rank.replace({'{': ''}, regex=True)
# rank.head()

In [33]:
# rank["rank"] = rank[1]

In [34]:
# rank = rank.drop([0,1], axis = 1)

In [36]:
sales.head()

,also_viewed,bought_together,also_bought
0,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN
1,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00..."
2,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00..."
3,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [37]:
sales = sales.join(rank)

In [38]:
sales.head()

,also_viewed,bought_together,also_bought,salesRank,price,product_name,product_id,rank,category
0,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN,{'Clothing': 1233557},6.99,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing
1,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00...",{'Sports &amp; Outdoors': 8547},6.79,Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors
2,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00...",{'Kitchen & Dining': 16987},64.98,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining
3,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN,{'Clothing': 1180499},NaN,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing
4,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN,{'Clothing': 1038084},NaN,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing

In [41]:
rank.head()

,salesRank,price,product_name,product_id,rank,category
0,{'Clothing': 1233557},6.99,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing
1,{'Sports &amp; Outdoors': 8547},6.79,Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors
2,{'Kitchen & Dining': 16987},64.98,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining
3,{'Clothing': 1180499},NaN,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing
4,{'Clothing': 1038084},NaN,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing

In [42]:
df = rank

In [51]:
dataset["item_price"] = 63*dataset["price"]

In [52]:
dataset = dataset.drop(["price"],axis=1)

In [45]:
# df = df.join(sales)
# df = df.join(rank)
# # new_df = df.sort_values("rank")

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1503384 entries, 0 to 1503383
Data columns (total 5 columns):
product_name    1502696 non-null object
product_id      1503384 non-null object
rank            1421649 non-null object
category        1503384 non-null object
item_price      574882 non-null float64
dtypes: float64(1), object(4)
memory usage: 57.3+ MB

In [60]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001533 entries, 0 to 1001532
Data columns (total 10 columns):
also_viewed        1001533 non-null object
bought_together    646136 non-null object
also_bought        444130 non-null object
salesRank          943368 non-null object
price              345371 non-null float64
product_name       1000929 non-null object
product_id         1001533 non-null object
rank               942872 non-null object
category           1001533 non-null object
item_price         345371 non-null float64
dtypes: float64(2), object(8)
memory usage: 76.4+ MB

In [48]:
df = df.drop(["salesRank"],axis = 1)

In [49]:
dataset = sales

In [53]:
dataset.head()

,also_viewed,bought_together,also_bought,salesRank,product_name,product_id,rank,category,item_price
0,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN,{'Clothing': 1233557},Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing,440.37
1,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00...",{'Sports &amp; Outdoors': 8547},Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors,427.77
2,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00...",{'Kitchen & Dining': 16987},SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining,4093.74
3,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN,{'Clothing': 1180499},RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing,NaN
4,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN,{'Clothing': 1038084},Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing,NaN

In [54]:
dataset.to_csv("Final.csv")

In [55]:
dataset = dataset[['product_id', 'product_name', 'category', 'rank', 'item_price','also_viewed','also_bought','bought_together']]

In [57]:
dataset.head()

,product_id,product_name,category,rank,item_price,also_viewed,also_bought,bought_together
0,0000037214,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,Clothing,1233557,440.37,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN
1,0000031887,Ballet Dress-Up Fairy Tutu,Sports &amp; Outdoors,8547,427.77,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...","'0000031852', '0000031895', '0000031909', 'B00...",'B00D23MC6W'
2,0123456479,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,Kitchen & Dining,16987,4093.74,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'"
3,0456844570,RiZ Women's Beautify Crafted &frac12; Rimmed F...,Clothing,1180499,NaN,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,0456808574,Lantin White Visor Wrap Around Ski Style Aviat...,Clothing,1038084,NaN,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [58]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001533 entries, 0 to 1001532
Data columns (total 8 columns):
product_id         1001533 non-null object
product_name       1000929 non-null object
category           1001533 non-null object
rank               942872 non-null object
item_price         345371 non-null float64
also_viewed        1001533 non-null object
also_bought        444130 non-null object
bought_together    646136 non-null object
dtypes: float64(1), object(7)
memory usage: 61.1+ MB

In [66]:
df.head()

,product_name,product_id,rank,category,item_price
0,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing,440.37
1,Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors,427.77
2,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining,4093.74
3,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing,NaN
4,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing,NaN

In [67]:
df['also_viewed'] = also_viewed[1]
df['bought_together'] = bought_together[1]
df['also_bought'] = also_bought[1]

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1503384 entries, 0 to 1503383
Data columns (total 8 columns):
product_name       1502696 non-null object
product_id         1503384 non-null object
rank               1421649 non-null object
category           1503384 non-null object
item_price         574882 non-null float64
also_viewed        1001533 non-null object
bought_together    646136 non-null object
also_bought        444130 non-null object
dtypes: float64(1), object(7)
memory usage: 91.8+ MB

In [71]:
df.head()

,product_name,product_id,rank,category,item_price,also_viewed,bought_together,also_bought
0,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing,440.37,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C']}",NaN,NaN
1,Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors,427.77,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00..."
2,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining,4093.74,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00..."
3,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing,NaN,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing,NaN,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [75]:
df.to_csv("OMG.csv")

In [73]:
df = df.replace({']}': ''}, regex=True)

In [74]:
df.head()

,product_name,product_id,rank,category,item_price,also_viewed,bought_together,also_bought
0,Purple Sequin Tiny Dancer Tutu Ballet Dance Fa...,0000037214,1233557,Clothing,440.37,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN
1,Ballet Dress-Up Fairy Tutu,0000031887,8547,Sports &amp; Outdoors,427.77,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00..."
2,SHINING IMAGE HUGE PINK LEATHER JEWELRY BOX / ...,0123456479,16987,Kitchen & Dining,4093.74,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00..."
3,RiZ Women's Beautify Crafted &frac12; Rimmed F...,0456844570,1180499,Clothing,NaN,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,Lantin White Visor Wrap Around Ski Style Aviat...,0456808574,1038084,Clothing,NaN,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [76]:
dummies = pd.get_dummies(df['category'])

In [77]:
dummies.head()

,,"Arts, Crafts & Sewing",Automotive,Baby,Beauty,Books,Camera &amp; Photo,Cell Phones & Accessories,Clothing,Computers & Accessories,...,Musical Instruments,Office Products,"Patio, Lawn & Garden",Pet Supplies,Shoes,Software,Sports &amp; Outdoors,Toys & Games,Video Games,Watches
0,0,0,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0